# Pandas 연습
- Series, DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
dic = {'city':['서울','부산','대전','광주','대구'],
      'year':[2017,2016,2018,2019,2019],
      'temp':[19,20,18,21,18]}
dic

{'city': ['서울', '부산', '대전', '광주', '대구'],
 'year': [2017, 2016, 2018, 2019, 2019],
 'temp': [19, 20, 18, 21, 18]}

In [4]:
df = pd.DataFrame(dic)

In [5]:
df

  city  year  temp
0   서울  2017    19
1   부산  2016    20
2   대전  2018    18
3   광주  2019    21
4   대구  2019    18

In [8]:
df[['city','temp']] # column access

  city  temp
0   서울    19
1   부산    20
2   대전    18
3   광주    21
4   대구    18

In [9]:
df.index = ['a','b','c','d','e'] ; df

  city  year  temp
a   서울  2017    19
b   부산  2016    20
c   대전  2018    18
d   광주  2019    21
e   대구  2019    18

In [11]:
df.columns

Index(['city', 'year', 'temp'], dtype='object')

In [12]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [13]:
df.values # array로 나옴

array([['서울', 2017, 19],
       ['부산', 2016, 20],
       ['대전', 2018, 18],
       ['광주', 2019, 21],
       ['대구', 2019, 18]], dtype=object)

In [14]:
df.set_index(['city'])

      year  temp
city
서울    2017    19
부산    2016    20
대전    2018    18
광주    2019    21
대구    2019    18

In [15]:
df

  city  year  temp
a   서울  2017    19
b   부산  2016    20
c   대전  2018    18
d   광주  2019    21
e   대구  2019    18

In [18]:
### 특정 컬럼을 access 
df[['temp','year']]

   temp  year
a    19  2017
b    20  2016
c    18  2018
d    21  2019
e    18  2019

In [19]:
df.year

a    2017
b    2016
c    2018
d    2019
e    2019
Name: year, dtype: int64

### row access

In [20]:
df

  city  year  temp
a   서울  2017    19
b   부산  2016    20
c   대전  2018    18
d   광주  2019    21
e   대구  2019    18

In [21]:
df.loc[['c','d']]

  city  year  temp
c   대전  2018    18
d   광주  2019    21

In [22]:
df = df.set_index('city')

In [23]:
df

      year  temp
city
서울    2017    19
부산    2016    20
대전    2018    18
광주    2019    21
대구    2019    18

In [24]:
df.loc[['대전','부산']]

      year  temp
city
대전    2018    18
부산    2016    20

In [26]:
df.loc['부산':'광주'] # 부산부터 광주까지 (광주앞까지가 아님)

      year  temp
city
부산    2016    20
대전    2018    18
광주    2019    21

In [27]:
df.loc['대전':'광주']['temp']

city
대전    18
광주    21
Name: temp, dtype: int64

In [28]:
df

      year  temp
city
서울    2017    19
부산    2016    20
대전    2018    18
광주    2019    21
대구    2019    18

In [29]:
df['year']

city
서울    2017
부산    2016
대전    2018
광주    2019
대구    2019
Name: year, dtype: int64

In [30]:
df.iloc[1] # i는 indexnumber

year    2016
temp      20
Name: 부산, dtype: int64

In [31]:
df.iloc[2:4] # 2부터 4까지 해야함

      year  temp
city
대전    2018    18
광주    2019    21

- 이름으로 할때는 포함
- 숫자로 할때는 범위에서 제외

In [35]:
df['car'] = [50,30,20,10,30];df

      year  temp  car
city
서울    2017    19   50
부산    2016    20   30
대전    2018    18   20
광주    2019    21   10
대구    2019    18   30

In [37]:
df['high'] = df.car;df

      year  temp  car  high
city
서울    2017    19   50    50
부산    2016    20   30    30
대전    2018    18   20    20
광주    2019    21   10    10
대구    2019    18   30    30

In [38]:
df['high2'] = (df.car >= 30);df

      year  temp  car  high  high2
city
서울    2017    19   50    50   True
부산    2016    20   30    30   True
대전    2018    18   20    20  False
광주    2019    21   10    10  False
대구    2019    18   30    30   True

In [40]:
df.drop('high',axis = 1) 
# index를 drop함 따라서  axis = 1이라고 선언해 줘야함
# 원래 df에서 high는 사라지지않았음

      year  temp  car  high2
city
서울    2017    19   50   True
부산    2016    20   30   True
대전    2018    18   20  False
광주    2019    21   10  False
대구    2019    18   30   True

In [41]:
df.drop('대구') # 기본 default가 axis = 0

      year  temp  car  high  high2
city
서울    2017    19   50    50   True
부산    2016    20   30    30   True
대전    2018    18   20    20  False
광주    2019    21   10    10  False

In [42]:
df.drop('대구',axis = 0)

      year  temp  car  high  high2
city
서울    2017    19   50    50   True
부산    2016    20   30    30   True
대전    2018    18   20    20  False
광주    2019    21   10    10  False

# 람다 함수
- 이름없는 함수 (이름을 줄 수도 있음)
- 대부분 일회성 함수에 사용

In [43]:
f = lambda x: x.max() - x.min()

In [46]:
df = pd.DataFrame(np.arange(12).reshape(4,3),columns=['A','B','C'],
                 index = ['a','b','c','d'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [47]:
df.apply(f)

A    9
B    9
C    9
dtype: int64

In [48]:
df.apply(lambda x: x.max()-x.min()) # 일회성, 이름없는 함수

A    9
B    9
C    9
dtype: int64

In [49]:
df.apply(f,axis=1)

a    2
b    2
c    2
d    2
dtype: int64

## Series - DataFrame의 한 컬럼

In [50]:
dic = {'서울':800,'부산':300,'대구':150}
dic

{'서울': 800, '부산': 300, '대구': 150}

In [51]:
s = pd.Series(dic); s

서울    800
부산    300
대구    150
dtype: int64

In [52]:
type(s)

pandas.core.series.Series

# Continue

In [54]:
obj = pd.Series(range(4),index=['d','a','b','c']); obj

d    0
a    1
b    2
c    3
dtype: int64

In [55]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [56]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [57]:
obj.sort_values(ascending=False)

c    3
b    2
a    1
d    0
dtype: int64

In [58]:
df = pd.DataFrame(np.arange(8).reshape(2,4), index = ['three','one'],columns=['d','a','b','c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [59]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [60]:
df.sort_values(by='d')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [61]:
df.sort_index(axis=1) # column 이름으로 sorting

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [64]:
df2 = pd.DataFrame({'b':[4,7,3,2],
                   'a':[4,9,2,5],
                   'c':[5,3,7,9]})
df2

   b  a  c
0  4  4  5
1  7  9  3
2  3  2  7
3  2  5  9

In [70]:
df2.sort_values(by='b')

   b  a  c
3  2  5  9
2  3  2  7
0  4  4  5
1  7  9  3

In [63]:
df2.rank()

     b    a    c
0  3.0  2.0  2.0
1  4.0  4.0  1.0
2  2.0  1.0  3.0
3  1.0  3.0  4.0

In [71]:
df2.rank(ascending=False) #순위매기기

     b    a    c
0  2.0  3.0  3.0
1  1.0  1.0  4.0
2  3.0  4.0  2.0
3  4.0  2.0  1.0

In [72]:
obj = pd.Series([100,23,100,44,22,99,33])
obj

0    100
1     23
2    100
3     44
4     22
5     99
6     33
dtype: int64

In [75]:
obj.rank(ascending=False) #동점이 있으면 평균 등수

0    1.5
1    6.0
2    1.5
3    4.0
4    7.0
5    3.0
6    5.0
dtype: float64

In [76]:
obj.rank(ascending=False,method='first') # 동점 중 먼저 나온게 우선

0    1.0
1    6.0
2    2.0
3    4.0
4    7.0
5    3.0
6    5.0
dtype: float64

In [79]:
df3 = pd.DataFrame({'b':[4,7,3,2],
                   'a':[4,9,2,5],
                   'c':[5,3,7,np.nan]})
df3

   b  a    c
0  4  4  5.0
1  7  9  3.0
2  3  2  7.0
3  2  5  NaN

In [88]:
df3.sum() #nan 무시됨

b    16.0
a    20.0
c    15.0
dtype: float64

In [99]:
df3.sum(skipna=False) #nan 보이기

b    16.0
a    20.0
c     NaN
dtype: float64

In [81]:
df3.mean()

b    4.0
a    5.0
c    5.0
dtype: float64

In [82]:
df3.max()

b    7.0
a    9.0
c    7.0
dtype: float64

In [84]:
df3.idxmax() #maximum의 index

b    1
a    1
c    2
dtype: int64

In [86]:
df3

   b  a    c
0  4  4  5.0
1  7  9  3.0
2  3  2  7.0
3  2  5  NaN

In [89]:
s3 = df3.b;s3

0    4
1    7
2    3
3    2
Name: b, dtype: int64

In [90]:
s4 = pd.Series([1,1,1,2,2,3,5,7,7]);s4

0    1
1    1
2    1
3    2
4    2
5    3
6    5
7    7
8    7
dtype: int64

In [91]:
s4.unique() #series에만 해당

array([1, 2, 3, 5, 7], dtype=int64)

In [94]:
s4.value_counts()

1    3
7    2
2    2
5    1
3    1
dtype: int64

In [96]:
s4.isin([2,7]) #있는지 여부 확인

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7     True
8     True
dtype: bool

# 결측치 처리

In [97]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,7])
data

0    1.0
1    NaN
2    3.5
3    7.0
dtype: float64

In [98]:
data.dropna() #nanumber만 drop

0    1.0
2    3.5
3    7.0
dtype: float64

In [102]:
data = pd.DataFrame([[NA,6.5,3],
                    [NA,NA,NA],
                    [NA,NA,NA],
                    [NA,7,3]])
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  7.0  3.0

In [103]:
data.dropna() #NA 하나라도 있으면 행을 삭제

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [104]:
data.dropna(how='all')

    0    1    2
0 NaN  6.5  3.0
3 NaN  7.0  3.0

In [105]:
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  7.0  3.0

In [106]:
data.dropna(how='all',axis=1) #0번 컬럼 삭제

     1    2
0  6.5  3.0
1  NaN  NaN
2  NaN  NaN
3  7.0  3.0

In [110]:
df4 = pd.DataFrame(np.random.randn(7,3));df4
df4.iloc[:4,1] = NA
df4.iloc[:2,2] = NA
df4.iloc[0,0] = NA
df4

          0         1         2
0       NaN       NaN       NaN
1 -0.429395       NaN       NaN
2 -0.670370       NaN -0.289974
3 -0.565110       NaN -1.415517
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [111]:
df4.dropna()

          0         1         2
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [112]:
df4.dropna(thresh=2)

          0         1         2
2 -0.670370       NaN -0.289974
3 -0.565110       NaN -1.415517
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [113]:
df4

          0         1         2
0       NaN       NaN       NaN
1 -0.429395       NaN       NaN
2 -0.670370       NaN -0.289974
3 -0.565110       NaN -1.415517
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [114]:
df4.fillna(0) #nan를 0으로 채워라

          0         1         2
0  0.000000  0.000000  0.000000
1 -0.429395  0.000000  0.000000
2 -0.670370  0.000000 -0.289974
3 -0.565110  0.000000 -1.415517
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [115]:
# 컬럼별로 다른 숫자로 채우고 싶을 때
df4.fillna({1:0.5,2:-1,0:0})

          0         1         2
0  0.000000  0.500000 -1.000000
1 -0.429395  0.500000 -1.000000
2 -0.670370  0.500000 -0.289974
3 -0.565110  0.500000 -1.415517
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [117]:
df4 = df4.fillna({1:0.5,2:-1,0:0}); df4

          0         1         2
0  0.000000  0.500000 -1.000000
1 -0.429395  0.500000 -1.000000
2 -0.670370  0.500000 -0.289974
3 -0.565110  0.500000 -1.415517
4  0.255333  0.636333  0.233885
5 -2.759194 -0.225086 -1.417509
6 -0.056526 -0.875982 -0.085730

In [118]:
dir(df4)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_only_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_percentile',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_const',
 '_combine_frame',
 '_combine_match_columns',
 '_combine_match_index',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_space_character_free_column_resolvers',
 '_get_value',
 '_get_values',
 '_getitem_bool_array',
 '_getitem_frame',
 '_getitem_multilevel',
 '_gotitem',
 '_iget_item_cache',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_cython_func',
 '_is_datelike_mixed_type',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_shallow_copy',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_frame_compat',
 '_unpickle_matrix_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_matrix',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combine_first',
 'compound',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sparse',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']